# boj 11047번 문제 - 동전 0 #
#     작성자 : 김도훈    #
#   날짜 : 2022.06.29   #
c,p = map(int,input().split()) # 동전 종류와 맞춰야될 값 받기
array = []
l = 0 # 실제로 사용할 동전 개수
t = 0 # 사용한 동전 총 개수
for i in range(c): # c번 반복
    n = int(input()) # n에 동전 종류를 받음
    if n <= p: # 맞춰야될 값보다 작거나 같다면 받음
        l += 1 # 동전 종류 1증가
        array.append(-n) # 값을 -로 저장(sort를 역순으로 하기 위함)

array.sort() # 동전을 큰 순서로 정렬
for i in array: # 배열의 큰 동전 순서대로 차례대로 계산
    if p // (-i) != 0: # p에서 동전을 나눴는데 0이 나오지 않는경우 -> 0이 나오면 동전이 더 크다는 뜻
        t += (p // (-i)) # t에 나눈 값 대입
        p %= (-i) # p에 나머지값 대입하고 다시 계산(반복)

print(t) # 총 동전 개수 출력