# boj 2475번 문제 - 이항계수 #
#     작성자 : 김도훈    #
#   날짜 : 2022.07.03   #
import sys
input = sys.stdin.readline # 입력을 빠르게 받기 위함
n,k = map(int, input().split()) # n과 k를 입력받음

s = 0
if 0 < k <= n: # k는 0보다 크고 n보다 같거나 작아야됨
    a = 1 # 팩토리얼을 구하기 위함(곱할 것이므로 0 이아닌 1을 대입)
    b = 1 # 팩토리얼을 구하기 위함(곱할 것이므로 0 이아닌 1을 대입)
    c = 1 # 팩토리얼을 구하기 위함(곱할 것이므로 0 이아닌 1을 대입)
    for i in range(2,n + 1): # 2 ~ n까지 반복(팩토리얼을 구함)
        a *= i # 팩토리얼 값을 a에 대입
    for i in range(2, k + 1): # 2 ~ k까지 반복(팩토리얼을 구함)
        b *= i # 팩토리얼 값을 b에 대입
    for i in range(2,n - k + 1): # 2 ~ n - k까지 반복(팩토리얼을 구함)
        c *= i # 팩토리얼 값을 c에 대입
    s = a // (b * c) # n! / (k! * (n - k)!)
elif k == 0: # k가 0이면
    s = 1 # 결과는 1임

print(s) # 결과 출력